### Limpieza_4
___

In [18]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import sidetable

In [19]:
df = pd.read_csv("data/bank_clean3.csv", index_col = 0)
pd.options.display.max_columns = None
df.head(1)

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,"emp,var,rate","cons,price,idx","cons,conf,idx",euribor3m,"nr,employed",y,month_day_week,month,day
0,56.0,housemaid,married,NaN,No,No,No,telephone,261,1.0,999,0,nonexistent,NaN,93.994,-36.4,4.857,"5191,0",no,"may, mon",may,mon

1. Lo primero que tenemos que evaluar es en que columnas tenemos nulos y que cantidad tenemos en cada una.

- ¿Hay alguna columna con una gran cantidad de nulos? En caso de que sea así deberemos eliminarla.

In [20]:
df.stb.missing()

                missing  total    percent
education         13943  41186  33.853737
emp,var,rate      12771  41186  31.008110
y                 12751  41186  30.959549
loan               8942  41186  21.711261
default            8597  41186  20.873598
marital            8203  41186  19.916962
job                4591  41186  11.146992
age                4302  41186  10.445297
cons,price,idx     4300  41186  10.440441
housing             990  41186   2.403729
campaign            432  41186   1.048900
euribor3m             0  41186   0.000000
month                 0  41186   0.000000
month_day_week        0  41186   0.000000
nr,employed           0  41186   0.000000
previous              0  41186   0.000000
cons,conf,idx         0  41186   0.000000
poutcome              0  41186   0.000000
pdays                 0  41186   0.000000
duration              0  41186   0.000000
contact               0  41186   0.000000
day                   0  41186   0.000000

No creemos que haya ninguan columna con una cantidad de nulos que justifique eliminarla. El mayor porcentaje de nulos lo encontramos en la columna education, con un 33,8%.

2. Es el momento de eliminar los nulos:

- Reemplazad los valores nulos de las columnas age y campaign por la media, redondeada a dos decimales.

In [21]:
df[['age', 'campaign']].describe().T

            count       mean       std   min   25%   50%   75%   max
age       36884.0  39.555146  9.603396  17.0  32.0  38.0  46.0  69.0
campaign  40754.0   2.040757  1.242130   1.0   1.0   2.0   3.0   6.0

In [22]:
df[['age', 'campaign']].mean().round(2)

age         39.56
campaign     2.04
dtype: float64

In [23]:
df['age'].fillna(df['age'].mean().round(2), inplace = True)
df['campaign'].fillna(df['campaign'].mean().round(2), inplace = True)

In [24]:
df[['age', 'campaign']].describe().T

            count       mean       std   min   25%   50%   75%   max
age       41186.0  39.555653  9.088003  17.0  33.0  39.0  45.0  69.0
campaign  41186.0   2.040749  1.235599   1.0   1.0   2.0   3.0   6.0

In [25]:
df.stb.missing()

                missing  total    percent
education         13943  41186  33.853737
emp,var,rate      12771  41186  31.008110
y                 12751  41186  30.959549
loan               8942  41186  21.711261
default            8597  41186  20.873598
marital            8203  41186  19.916962
job                4591  41186  11.146992
cons,price,idx     4300  41186  10.440441
housing             990  41186   2.403729
age                   0  41186   0.000000
cons,conf,idx         0  41186   0.000000
month                 0  41186   0.000000
month_day_week        0  41186   0.000000
nr,employed           0  41186   0.000000
euribor3m             0  41186   0.000000
previous              0  41186   0.000000
poutcome              0  41186   0.000000
pdays                 0  41186   0.000000
campaign              0  41186   0.000000
duration              0  41186   0.000000
contact               0  41186   0.000000
day                   0  41186   0.000000

- Reemplazad los valores nulos de la columna emp.var.rate y cons.price.idx por la mediana de cada una de estas columnas, redondeada a dos decimales.

In [26]:
df['emp,var,rate'].fillna(df['emp,var,rate'].median().round(2), inplace = True)
df['cons,price,idx'].fillna(df['cons,price,idx'].median().round(2), inplace = True)

In [27]:
df.stb.missing()

                missing  total    percent
education         13943  41186  33.853737
y                 12751  41186  30.959549
loan               8942  41186  21.711261
default            8597  41186  20.873598
marital            8203  41186  19.916962
job                4591  41186  11.146992
housing             990  41186   2.403729
age                   0  41186   0.000000
cons,price,idx        0  41186   0.000000
month                 0  41186   0.000000
month_day_week        0  41186   0.000000
nr,employed           0  41186   0.000000
euribor3m             0  41186   0.000000
cons,conf,idx         0  41186   0.000000
previous              0  41186   0.000000
emp,var,rate          0  41186   0.000000
poutcome              0  41186   0.000000
pdays                 0  41186   0.000000
campaign              0  41186   0.000000
duration              0  41186   0.000000
contact               0  41186   0.000000
day                   0  41186   0.000000

- En relación a las columnas de education, default, housing y loan al tratarse de columnas de tipo categórica, reemplazad los valores nulos por una nueva categória que se llame unknown.

In [28]:
df[['education', 'default', 'housing', 'loan']] = df[['education', 'default', 'housing', 'loan']].replace(np.nan, 'unknown')

In [29]:
df.stb.missing()

                missing  total    percent
y                 12751  41186  30.959549
marital            8203  41186  19.916962
job                4591  41186  11.146992
age                   0  41186   0.000000
poutcome              0  41186   0.000000
month                 0  41186   0.000000
month_day_week        0  41186   0.000000
nr,employed           0  41186   0.000000
euribor3m             0  41186   0.000000
cons,conf,idx         0  41186   0.000000
cons,price,idx        0  41186   0.000000
emp,var,rate          0  41186   0.000000
previous              0  41186   0.000000
pdays                 0  41186   0.000000
campaign              0  41186   0.000000
duration              0  41186   0.000000
contact               0  41186   0.000000
loan                  0  41186   0.000000
housing               0  41186   0.000000
default               0  41186   0.000000
education             0  41186   0.000000
day                   0  41186   0.000000

- Reemplazad los valores nulos de las columna job y marital por el valor más frecuente (la moda).

In [30]:
df[['job', 'marital']].mode()

              job  marital
0  administration  married

In [31]:
df['job'].replace(np.nan, df['job'].mode()[0], inplace = True)
df['marital'].replace(np.nan, df['marital'].mode()[0], inplace = True)

In [32]:
df.stb.missing()

                missing  total    percent
y                 12751  41186  30.959549
age                   0  41186   0.000000
job                   0  41186   0.000000
month                 0  41186   0.000000
month_day_week        0  41186   0.000000
nr,employed           0  41186   0.000000
euribor3m             0  41186   0.000000
cons,conf,idx         0  41186   0.000000
cons,price,idx        0  41186   0.000000
emp,var,rate          0  41186   0.000000
poutcome              0  41186   0.000000
previous              0  41186   0.000000
pdays                 0  41186   0.000000
campaign              0  41186   0.000000
duration              0  41186   0.000000
contact               0  41186   0.000000
loan                  0  41186   0.000000
housing               0  41186   0.000000
default               0  41186   0.000000
education             0  41186   0.000000
marital               0  41186   0.000000
day                   0  41186   0.000000

- Nos quedan la columna y. ¿Qué tipo de variable es? Decidid cual sería la mejor gestión de nulos para esta columna.

In [34]:
df.dtypes

age               float64
job                object
marital            object
education          object
default            object
housing            object
loan               object
contact            object
duration            int64
campaign          float64
pdays               int64
previous            int64
poutcome           object
emp,var,rate      float64
cons,price,idx    float64
cons,conf,idx     float64
euribor3m         float64
nr,employed        object
y                  object
month_day_week     object
month              object
day                object
dtype: object

In [35]:
df['y'].value_counts()

y
no     25294
yes     3141
Name: count, dtype: int64

In [36]:
df[df['y'].isnull()]

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,"emp,var,rate","cons,price,idx","cons,conf,idx",euribor3m,"nr,employed",y,month_day_week,month,day
2,37.00,services,married,high school,No,Sí,No,telephone,226,1.0,999,0,nonexistent,1.1,93.994,-36.4,4.857,"5191,0",NaN,"may, mon",may,mon
5,45.00,services,married,basic 9y,unknown,No,No,telephone,198,1.0,999,0,nonexistent,1.1,93.994,-36.4,4.857,"5191,0",NaN,"may, mon",may,mon
11,39.56,services,single,unknown,No,Sí,No,telephone,222,1.0,999,0,nonexistent,1.1,93.750,-36.4,4.857,"5191,0",NaN,"may, mon",may,mon
13,57.00,housemaid,divorced,basic 4y,No,Sí,unknown,telephone,293,1.0,999,0,nonexistent,1.1,93.994,-36.4,4.857,"5191,0",NaN,"may, mon",may,mon
18,50.00,administration,married,unknown,No,Sí,Sí,telephone,353,1.0,999,0,nonexistent,1.1,93.994,-36.4,4.857,"5191,0",NaN,"may, mon",may,mon
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
41170,40.00,management,divorced,university degree,No,Sí,No,cellular,293,2.0,999,4,failure,-1.1,94.767,-50.8,1.030,"4963,6",NaN,"nov, wed",nov,wed
41172,39.56,administration,married,university degree,No,Sí,No,cellular,353,1.0,999,0,nonexistent,1.1,93.750,-50.8,1.031,"4963,6",NaN,"nov, thu",nov,thu
41174,62.00,retired,married,unknown,No,Sí,No,cellular,208,1.0,1,6,success,1.1,93.750,-50.8,1.031,"4963,6",NaN,"nov, thu",nov,thu
41180,36.00,administration,married,university degree,No,No,No,cellular,254,2.0,999,0,nonexistent,-1.1,94.767,-50.8,1.028,"4963,6",NaN,"nov, fri",nov,fri
41186,44.00,technician,married,professional course,No,No,No,cellular,442,1.0,999,0,nonexistent,-1.1,94.767,-50.8,1.028,"4963,6",NaN,"nov, fri",nov,fri

Debido a los datos que tenemos, hemos decidido cambiar los nulos por una nueva categoría (unknown), y no sustituirlo por la moda, ya que tenemos solo dos valores para esa columna ( no y yes), y nuestros datos podrían verse muy afectados.

In [43]:
df['y'] = df['y'].replace(np.nan, 'unknown')

In [44]:
df.stb.missing()

                missing  total  percent
age                   0  41186      0.0
job                   0  41186      0.0
month                 0  41186      0.0
month_day_week        0  41186      0.0
y                     0  41186      0.0
nr,employed           0  41186      0.0
euribor3m             0  41186      0.0
cons,conf,idx         0  41186      0.0
cons,price,idx        0  41186      0.0
emp,var,rate          0  41186      0.0
poutcome              0  41186      0.0
previous              0  41186      0.0
pdays                 0  41186      0.0
campaign              0  41186      0.0
duration              0  41186      0.0
contact               0  41186      0.0
loan                  0  41186      0.0
housing               0  41186      0.0
default               0  41186      0.0
education             0  41186      0.0
marital               0  41186      0.0
day                   0  41186      0.0

3. Guardad el csv.

In [45]:
df.to_csv('data/bank_clean4.csv')